In [1]:
# Dependencies
import pandas as pd
import numpy as np
from sqlalchemy import create_engine
import psycopg2

In [2]:
# Read in Training Data
training_data = "data/Training.csv"
training_df = pd.read_csv(training_data)
training_df

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
0,8949,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,NaN,NaN,1,36,1.0
1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0.0
2,11561,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,never,83,0.0
3,33241,city_115,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,never,52,1.0
4,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
19153,7386,city_173,0.878,Male,No relevent experience,no_enrollment,Graduate,Humanities,14,NaN,NaN,1,42,1.0
19154,31398,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,14,NaN,NaN,4,52,1.0
19155,24576,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,50-99,Pvt Ltd,4,44,0.0
19156,5756,city_65,0.802,Male,Has relevent experience,no_enrollment,High School,NaN,<1,500-999,Pvt Ltd,2,97,0.0
19157,23834,city_67,0.855,NaN,No relevent experience,no_enrollment,Primary School,NaN,2,NaN,NaN,1,127,0.0

In [3]:
# Check Training Data
training_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19158 entries, 0 to 19157
Data columns (total 14 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   enrollee_id             19158 non-null  int64
 1   city                    19158 non-null  object
 2   city_development_index  19158 non-null  float64
 3   gender                  14650 non-null  object
 4   relevent_experience     19158 non-null  object
 5   enrolled_university     18772 non-null  object
 6   education_level         18698 non-null  object
 7   major_discipline        16345 non-null  object
 8   experience              19093 non-null  object
 9   company_size            13220 non-null  object
 10  company_type            13018 non-null  object
 11  last_new_job            18735 non-null  object
 12  training_hours          19158 non-null  int64
 13  target                  19158 non-null  float64
dtypes: float64(2), int64(2), object(10)
memory usage: 2.0+ MB

In [4]:
# Remove City Column
training_df.drop('city', axis = 'columns', inplace=True)
training_df

,enrollee_id,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
0,8949,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,NaN,NaN,1,36,1.0
1,29725,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0.0
2,11561,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,never,83,0.0
3,33241,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,never,52,1.0
4,666,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
19153,7386,0.878,Male,No relevent experience,no_enrollment,Graduate,Humanities,14,NaN,NaN,1,42,1.0
19154,31398,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,14,NaN,NaN,4,52,1.0
19155,24576,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,50-99,Pvt Ltd,4,44,0.0
19156,5756,0.802,Male,Has relevent experience,no_enrollment,High School,NaN,<1,500-999,Pvt Ltd,2,97,0.0
19157,23834,0.855,NaN,No relevent experience,no_enrollment,Primary School,NaN,2,NaN,NaN,1,127,0.0

In [5]:
# Reheck Training Data
training_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19158 entries, 0 to 19157
Data columns (total 13 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   enrollee_id             19158 non-null  int64
 1   city_development_index  19158 non-null  float64
 2   gender                  14650 non-null  object
 3   relevent_experience     19158 non-null  object
 4   enrolled_university     18772 non-null  object
 5   education_level         18698 non-null  object
 6   major_discipline        16345 non-null  object
 7   experience              19093 non-null  object
 8   company_size            13220 non-null  object
 9   company_type            13018 non-null  object
 10  last_new_job            18735 non-null  object
 11  training_hours          19158 non-null  int64
 12  target                  19158 non-null  float64
dtypes: float64(2), int64(2), object(9)
memory usage: 1.9+ MB

In [6]:
# Drop Rows with NaN
training_df = training_df.dropna()
training_df

,enrollee_id,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
1,29725,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0.0
4,666,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0.0
7,402,0.762,Male,Has relevent experience,no_enrollment,Graduate,STEM,13,<10,Pvt Ltd,>4,18,1.0
8,27107,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,7,50-99,Pvt Ltd,1,46,1.0
11,23853,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,5,5000-9999,Pvt Ltd,1,108,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
19147,21319,0.624,Male,No relevent experience,Full time course,Graduate,STEM,1,100-500,Pvt Ltd,1,52,1.0
19149,251,0.920,Male,Has relevent experience,no_enrollment,Masters,STEM,9,50-99,Pvt Ltd,1,36,1.0
19150,32313,0.920,Female,Has relevent experience,no_enrollment,Graduate,STEM,10,100-500,Public Sector,3,23,0.0
19152,29754,0.920,Female,Has relevent experience,no_enrollment,Graduate,Humanities,7,10/49,Funded Startup,1,25,0.0
19155,24576,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,50-99,Pvt Ltd,4,44,0.0

In [7]:
# Reheck Training Data
training_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8955 entries, 1 to 19155
Data columns (total 13 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   enrollee_id             8955 non-null   int64
 1   city_development_index  8955 non-null   float64
 2   gender                  8955 non-null   object
 3   relevent_experience     8955 non-null   object
 4   enrolled_university     8955 non-null   object
 5   education_level         8955 non-null   object
 6   major_discipline        8955 non-null   object
 7   experience              8955 non-null   object
 8   company_size            8955 non-null   object
 9   company_type            8955 non-null   object
 10  last_new_job            8955 non-null   object
 11  training_hours          8955 non-null   int64
 12  target                  8955 non-null   float64
dtypes: float64(2), int64(2), object(9)
memory usage: 979.5+ KB

In [8]:
# Read in Testing Data
testing_data = "data/Testing.csv"
testing_df = pd.read_csv(testing_data)
testing_df

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours
0,26581,city_1,0.847,Male,Has relevent experience,no_enrollment,Graduate,STEM,5,50-99,NaN,2,18
1,2610,city_1,0.847,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,NaN,NaN,>4,9
2,27463,city_10,0.895,NaN,No relevent experience,no_enrollment,Masters,STEM,>20,100-500,Pvt Ltd,2,62
3,31483,city_10,0.895,NaN,No relevent experience,no_enrollment,Graduate,STEM,14,1000-4999,Pvt Ltd,NaN,40
4,11646,city_10,0.895,Male,Has relevent experience,no_enrollment,Graduate,STEM,8,Oct-49,Pvt Ltd,1,78
...,...,...,...,...,...,...,...,...,...,...,...,...,...
2124,29159,city_99,0.915,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,1000-4999,Pvt Ltd,>4,40
2125,8903,city_99,0.915,NaN,Has relevent experience,no_enrollment,Graduate,STEM,9,1000-4999,Pvt Ltd,1,68
2126,22342,city_99,0.915,Female,No relevent experience,Full time course,Graduate,STEM,5,Oct-49,Pvt Ltd,1,21
2127,28220,city_99,0.915,Male,No relevent experience,no_enrollment,Graduate,STEM,>20,<10,Pvt Ltd,>4,47
2128,8837,city_99,0.915,NaN,Has relevent experience,no_enrollment,NaN,NaN,>20,50-99,Pvt Ltd,2,79

In [9]:
# Check Testing Data
testing_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2129 entries, 0 to 2128
Data columns (total 13 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   enrollee_id             2129 non-null   int64
 1   city                    2129 non-null   object
 2   city_development_index  2129 non-null   float64
 3   gender                  1621 non-null   object
 4   relevent_experience     2129 non-null   object
 5   enrolled_university     2098 non-null   object
 6   education_level         2077 non-null   object
 7   major_discipline        1817 non-null   object
 8   experience              2124 non-null   object
 9   company_size            1507 non-null   object
 10  company_type            1495 non-null   object
 11  last_new_job            2089 non-null   object
 12  training_hours          2129 non-null   int64
dtypes: float64(1), int64(2), object(10)
memory usage: 216.4+ KB

In [10]:
# Remove City Column
testing_df.drop('city', axis = 'columns', inplace=True)
testing_df

,enrollee_id,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours
0,26581,0.847,Male,Has relevent experience,no_enrollment,Graduate,STEM,5,50-99,NaN,2,18
1,2610,0.847,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,NaN,NaN,>4,9
2,27463,0.895,NaN,No relevent experience,no_enrollment,Masters,STEM,>20,100-500,Pvt Ltd,2,62
3,31483,0.895,NaN,No relevent experience,no_enrollment,Graduate,STEM,14,1000-4999,Pvt Ltd,NaN,40
4,11646,0.895,Male,Has relevent experience,no_enrollment,Graduate,STEM,8,Oct-49,Pvt Ltd,1,78
...,...,...,...,...,...,...,...,...,...,...,...,...
2124,29159,0.915,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,1000-4999,Pvt Ltd,>4,40
2125,8903,0.915,NaN,Has relevent experience,no_enrollment,Graduate,STEM,9,1000-4999,Pvt Ltd,1,68
2126,22342,0.915,Female,No relevent experience,Full time course,Graduate,STEM,5,Oct-49,Pvt Ltd,1,21
2127,28220,0.915,Male,No relevent experience,no_enrollment,Graduate,STEM,>20,<10,Pvt Ltd,>4,47
2128,8837,0.915,NaN,Has relevent experience,no_enrollment,NaN,NaN,>20,50-99,Pvt Ltd,2,79

In [11]:
# Recheck Testing Data
testing_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2129 entries, 0 to 2128
Data columns (total 12 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   enrollee_id             2129 non-null   int64
 1   city_development_index  2129 non-null   float64
 2   gender                  1621 non-null   object
 3   relevent_experience     2129 non-null   object
 4   enrolled_university     2098 non-null   object
 5   education_level         2077 non-null   object
 6   major_discipline        1817 non-null   object
 7   experience              2124 non-null   object
 8   company_size            1507 non-null   object
 9   company_type            1495 non-null   object
 10  last_new_job            2089 non-null   object
 11  training_hours          2129 non-null   int64
dtypes: float64(1), int64(2), object(9)
memory usage: 199.7+ KB

In [12]:
# Drop Rows with NaN
testing_df = testing_df.dropna()
testing_df

,enrollee_id,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours
4,11646,0.895,Male,Has relevent experience,no_enrollment,Graduate,STEM,8,Oct-49,Pvt Ltd,1,78
7,22870,0.895,Male,Has relevent experience,no_enrollment,Graduate,Other,8,50-99,Early Stage Startup,1,10
8,16955,0.895,Male,Has relevent experience,Full time course,Masters,STEM,>20,1000-4999,Public Sector,>4,90
24,29341,0.887,Female,Has relevent experience,no_enrollment,Graduate,STEM,17,100-500,Pvt Ltd,>4,9
31,19744,0.887,Male,Has relevent experience,no_enrollment,Masters,STEM,14,100-500,Pvt Ltd,4,144
...,...,...,...,...,...,...,...,...,...,...,...,...
2122,25866,0.915,Male,Has relevent experience,no_enrollment,Graduate,STEM,7,Oct-49,Pvt Ltd,>4,6
2123,5509,0.915,Female,Has relevent experience,no_enrollment,Masters,STEM,>20,100-500,Pvt Ltd,1,29
2124,29159,0.915,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,1000-4999,Pvt Ltd,>4,40
2126,22342,0.915,Female,No relevent experience,Full time course,Graduate,STEM,5,Oct-49,Pvt Ltd,1,21
2127,28220,0.915,Male,No relevent experience,no_enrollment,Graduate,STEM,>20,<10,Pvt Ltd,>4,47

In [13]:
# Recheck Testing Data
testing_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1019 entries, 4 to 2127
Data columns (total 12 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   enrollee_id             1019 non-null   int64
 1   city_development_index  1019 non-null   float64
 2   gender                  1019 non-null   object
 3   relevent_experience     1019 non-null   object
 4   enrolled_university     1019 non-null   object
 5   education_level         1019 non-null   object
 6   major_discipline        1019 non-null   object
 7   experience              1019 non-null   object
 8   company_size            1019 non-null   object
 9   company_type            1019 non-null   object
 10  last_new_job            1019 non-null   object
 11  training_hours          1019 non-null   int64
dtypes: float64(1), int64(2), object(9)
memory usage: 103.5+ KB

In [20]:
# Merge dataframes
dsjs_df = pd.concat([training_df, testing_df],0)
dsjs_df

,enrollee_id,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
1,29725,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0.0
4,666,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0.0
7,402,0.762,Male,Has relevent experience,no_enrollment,Graduate,STEM,13,<10,Pvt Ltd,>4,18,1.0
8,27107,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,7,50-99,Pvt Ltd,1,46,1.0
11,23853,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,5,5000-9999,Pvt Ltd,1,108,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
2122,25866,0.915,Male,Has relevent experience,no_enrollment,Graduate,STEM,7,Oct-49,Pvt Ltd,>4,6,NaN
2123,5509,0.915,Female,Has relevent experience,no_enrollment,Masters,STEM,>20,100-500,Pvt Ltd,1,29,NaN
2124,29159,0.915,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,1000-4999,Pvt Ltd,>4,40,NaN
2126,22342,0.915,Female,No relevent experience,Full time course,Graduate,STEM,5,Oct-49,Pvt Ltd,1,21,NaN
2127,28220,0.915,Male,No relevent experience,no_enrollment,Graduate,STEM,>20,<10,Pvt Ltd,>4,47,NaN

In [21]:
# Recheck Testing Data
dsjs_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 9974 entries, 1 to 2127
Data columns (total 13 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   enrollee_id             9974 non-null   int64
 1   city_development_index  9974 non-null   float64
 2   gender                  9974 non-null   object
 3   relevent_experience     9974 non-null   object
 4   enrolled_university     9974 non-null   object
 5   education_level         9974 non-null   object
 6   major_discipline        9974 non-null   object
 7   experience              9974 non-null   object
 8   company_size            9974 non-null   object
 9   company_type            9974 non-null   object
 10  last_new_job            9974 non-null   object
 11  training_hours          9974 non-null   int64
 12  target                  8955 non-null   float64
dtypes: float64(2), int64(2), object(9)
memory usage: 1.4+ MB